Catalogs/ТелеграмОбработкаЧёткиеШаблоныСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>ТелеграмОбработкаЧёткиеШаблоныСообщений</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДоступУровеньОбработчика</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Шаблон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Действие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыДействий</v8:Type>
						<v8:Type>cfg:CatalogRef.Действия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФиксированныйТекстовыйОтвет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Активность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыполнятьКодПослеСовершенияДействия</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыполняемыйКодПослеСовершенияДействия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПеременныеДляПроцедуры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяПеременной</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
								<v8:TypeSet>cfg:BusinessProcessRoutePointRef</v8:TypeSet>
								<v8:TypeSet>cfg:BusinessProcessRef</v8:TypeSet>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
								<v8:TypeSet>cfg:EnumRef</v8:TypeSet>
								<v8:TypeSet>cfg:ChartOfCalculationTypesRef</v8:TypeSet>
								<v8:TypeSet>cfg:TaskRef</v8:TypeSet>
								<v8:TypeSet>cfg:ChartOfCharacteristicTypesRef</v8:TypeSet>
								<v8:TypeSet>cfg:ChartOfAccountsRef</v8:TypeSet>
								<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>32</v8:Digits>
									<v8:FractionDigits>10</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ГруппыДействий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>ГруппыДействий</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ГруппаУсловий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыУсловий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Действия</Name>
					<Comment>Совершаемые действия</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Действие</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Действия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГруппаУсловий</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ГруппыУсловий</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОжидатьЗавершения</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ТелеграмОбработкаЧёткиеШаблоныСообщений/Ext/ManagerModule.bsl
Функция ОбработатьТекстПоЧёткомуСовпадениюВсегоСообщенияСШаблоном(СсылкаДокВхСообщение) Экспорт
	
	РезультатОбработки = Ложь;
	
	ПозицияАдресаБота = СтрНайти(СсылкаДокВхСообщение.Текст, ТелеграмМодуль.ПолучитьАдресТелеграмБота());
	Если ПозицияАдресаБота > 0 Тогда
		ТекстСообщения = Лев(СсылкаДокВхСообщение.Текст, ПозицияАдресаБота-1);
	Иначе
		ТекстСообщения = СсылкаДокВхСообщение.Текст;
	КонецЕсли;

	Шаблон = Справочники.ТелеграмОбработкаЧёткиеШаблоныСообщений.НайтиПоРеквизиту("Шаблон", ТекстСообщения); 
	Если ЗначениеЗаполнено(Шаблон) И Шаблон.Активность Тогда 
		
		Если СсылкаДокВхСообщение.ТелеграмКонтакт.ДоступМаксимальныйУровеньОбработчика >= Шаблон.ДоступУровеньОбработчика Тогда //Выполняем 
			Если ЗначениеЗаполнено(Шаблон.Действие) Тогда // Выполняем
				Если ТипЗнч(Шаблон.Действие) = Тип("СправочникСсылка.Действия") Тогда 
					МассивСДействием = Новый Массив();
					МассивСДействием.Добавить(Шаблон.Действие);
				    Справочники.Действия.ВыполнитьДействия(МассивСДействием);
				ИначеЕсли ТипЗнч(Шаблон.Действие) = Тип("СправочникСсылка.ГруппыДействий") Тогда 
					Справочники.ГруппыДействий.ВыполнитьГруппуДействий(Шаблон.Действие);
				КонецЕсли;
			КонецЕсли;
			
			ОтветТекст = Шаблон.ФиксированныйТекстовыйОтвет;
			
			Если Шаблон.ВыполнятьКодПослеСовершенияДействия Тогда 
				Ответ = "";
				
				ТекстПолученияПеременных = "";
				МассивЗначенийПеременных = Новый Массив();
				н = -1;
				Для Каждого СтрокаПеременной Из Шаблон.ПеременныеДляПроцедуры Цикл
					н = н + 1;
					ТекстПолученияПеременных = ТекстПолученияПеременных + СтрокаПеременной.ИмяПеременной + " = "
					+ "МассивЗначенийПеременных[" + н + "];" + Символы.ПС;
					МассивЗначенийПеременных.Добавить(СтрокаПеременной.Значение);		
				КонецЦикла;
				пВыполняемыйКодПослеСовершенияДействия = ТекстПолученияПеременных +	Шаблон.ВыполняемыйКодПослеСовершенияДействия;
				Попытка
					Ответ = ВыполнитьКодШаблонаИзолированно(СсылкаДокВхСообщение, пВыполняемыйКодПослеСовершенияДействия);	
				Исключение
					ОписаниеОшибки = "Сбой при обработки шаблона после совершения действия. Шаблон: """ +  Шаблон.Шаблон + """. Описание ошибки: " + ОписаниеОшибки();
					ЗаписьВЖурналОшибок("Справочники.ТелеграмОбработкаЧёткиеШаблоныСообщений.МодульМенеджера", "ОбработатьТекстПоЧёткомуСовпадениюВсегоСообщенияСШаблоном", ОписаниеОшибки);	
					Результат = Ложь;
				КонецПопытки;
	
				Если ЗначениеЗаполнено(Ответ) Тогда 
					ОтветТекст = ?(ЗначениеЗаполнено(ОтветТекст), ОтветТекст + Символы.ПС + Ответ, Ответ);
				КонецЕсли;
			КонецЕсли;
			
		Иначе // Если доступа нет то обработка по шаблоку не выполняется но сообщение считается обработанным, возвращаем уведомление
			ОтветТекст = "Нет прав на обработку чётким шаблоном """ + Шаблон.Шаблон + """";
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ОтветТекст) Тогда
			СтруктураОтвета = Новый Структура();
			СтруктураОтвета.Вставить("ТелеграмКонтакт", СсылкаДокВхСообщение.ТелеграмКонтакт); 
			СтруктураОтвета.Вставить("Текст", ОтветТекст);
			
			ТелеграмМодуль.СоздатьИОтправитьДокСообщениеИсходящие(СтруктураОтвета);	
		КонецЕсли;
					          
		РезультатОбработки = Истина;	
	КонецЕсли;
		
	Возврат РезультатОбработки;	
	
КонецФункции

Функция ВыполнитьКодШаблонаИзолированно(СсылкаНаСообщение, ВыполняемыйКодПослеСовершенияДействия);
	
	СсылкаДокВхСообщение = СсылкаНаСообщение;
	пВыполняемыйКодПослеСовершенияДействия = ВыполняемыйКодПослеСовершенияДействия;
	Ответ = "";
	
	Выполнить(пВыполняемыйКодПослеСовершенияДействия);
	
	Возврат Ответ;
	
КонецФункции
